{"additionalType": "Concept", "name": "Abductive reasoning", "@context": ["http://schema.org"], "image": "", "url": "https://en.wikipedia.org/wiki/Abductive_reasoning", "alternateName": "abductive inference", "@type": ["Thing"], "sameAs": "https://en.wikipedia.org/wiki/Abductive_reasoning", "description": "A form of logical inference which goes from an observation to a theory which accounts for the observation, ideally seeking to find the simplest and most likely explanation. In abductive reasoning, unlike in deductive reasoning, the premises do not guarantee the conclusion. One can understand abductive reasoning as 'inferencetothebestexplanation'. In the 1990s, as computing power grew, the fields of law, computer science, and artificial intelligence research spurred renewed interest in the subject of abduction. Diagnostic expert systems frequently employ abduction. The American philosopher Charles Sanders Peirce (1839–1914) first introduced the term as 'guessing'. Peirce said that to abduce a hypothetical explanation a  from an observed circumstance b  b is to surmise that a  a may be true because then b  b would be a matter of course. Thus, to abduce a  a from b  b involves determining that a  a is sufficient, but not necessary, for b  b. For example, suppose we observe that the lawn is wet. If it rained last night, then it would be unsurprising that the lawn is wet. Therefore, by abductive reasoning, the possibility that it rained last night is reasonable, although Peirce did not remain convinced that a single logical form covers all abduction. Some other process could have also resulted in a wet lawn, such as dew or lawn sprinklers. Consequently, abducing that it rained last night from the observation of a wet lawn can lead to a false conclusion. Peirce argues that good abductive reasoning from P to Q involves not simply a determination that Q is sufficient for P, but also that Q is among the most economical explanations for P. Simplification and economy both call for that 'leap' of abduction."}