{"deathPlace": "Cambridge, England, United Kingdom", "jobTitle": "Philosopher", "knows": "https://en.wikipedia.org/wiki/Ludwig_Wittgenstein", "@context": ["http://schema.org"], "givenName": "Ludwig", "url": "https://en.wikipedia.org/wiki/Ludwig_Wittgenstein", "familyName": "Wittgenstein", "address": "Vienna, Austria", "homeLocation": "Vienna, Austria-Hungary", "deathDate": "1961-04-29", "description": "Ludwig Josef Johann Wittgenstein was an Austrian-British philosopher who worked primarily in logic, the philosophy of mathematics, the philosophy of mind, and the philosophy of language.[7] From 1929 to 1947, Wittgenstein taught at the University of Cambridge. During his lifetime he published just one slim book, the 75-page Tractatus Logico-Philosophicus (1921), one article, one book review and a children's dictionary.[9] His voluminous manuscripts were edited and published posthumously. Philosophical Investigations appeared as a book in 1953, and has since come to be recognised as one of the most important works of philosophy in the twentieth century. His teacher Bertrand Russell described Wittgenstein as 'the most perfect example I have ever known of genius as traditionally conceived; passionate, profound, intense, and dominating.' Born in Vienna into one of Europe's richest families, he inherited a large fortune from his father in 1913. He gave some considerable sums to poor artists. In a period of severe personal depression after the First World War, he then gave away his entire fortune to his brothers and sisters. Three of his brothers committed suicide, with Wittgenstein contemplating it too. He left academia several times—serving as an officer on the front line during World War I, where he was decorated a number of times for his courage; teaching in schools in remote Austrian villages where he encountered controversy for hitting children when they made mistakes in mathematics; and working as a hospital porter during World War II in London where he told patients not to take the drugs they were prescribed while largely managing to keep secret the fact that he was one of the world's most famous philosophers. He described philosophy as 'the only work that gives me real satisfaction.' His philosophy is often divided into an early period, exemplified by the Tractatus, and a later period, articulated in the Philosophical Investigations. The early Wittgenstein was concerned with the logical relationship between propositions and the world and believed that by providing an account of the logic underlying this relationship, he had solved all philosophical problems. The later Wittgenstein rejected many of the assumptions of the Tractatus, arguing that the meaning of words is best understood as their use within a given language-game.", "sameAs": "http://wab.aksis.uib.no/index.page", "name": "Ludwig Wittgenstein", "image": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Ludwig_Wittgenstein.jpg", "birthPlace": "Vienna, Austria-Hungary", "@type": ["Person"], "additionalName": "Ludwig Josef Johann Wittgenstein", "birthDate": "1889-05-26"}