{"deathPlace": "Vienna, Austria", "jobTitle": "Philosopher", "knows": "https://en.wikipedia.org/wiki/William_James", "@context": ["http://schema.org"], "givenName": "Friedrich", "url": "https://en.wikipedia.org/wiki/Moritz_Schlick", "familyName": "Schilick", "address": "Berlin, Germany", "homeLocation": "Berlin, Germany", "deathDate": "+1936-06-22T00:00:00Z", "description": "Friedrich Albert Moritz Schlick was a German philosopher, physicist, and the founding father of logical positivism and the Vienna Circle. After early appointments at Rostock and Kiel, in 1922 Schlick assumed the chair of Naturphilosophie at the University of Vienna which had previously been held by Ludwig Boltzmann and Ernst Mach. Schlick displayed an unusual success in organizing talented individuals in the philosophical and scientific spheres. When Schlick arrived in Vienna, he was invited to lead a group of scientists and philosophers who met regularly (on Thursday evenings in the Chemistry Building) to discuss philosophical topics in the sciences. Early members included the mathematician Hans Hahn and, within a few years, they were joined by Rudolf Carnap, Herbert Feigl, Kurt Gödel, Otto Neurath, Friedrich Waismann and others. They initially called themselves the Ernst Mach Association, but forever after they have been known as the Vienna Circle. In the years 1925-1926, the Thursday night group discussed recent work in the foundations of mathematics by Gottlob Frege, Bertrand Russell, and Ludwig Wittgenstein. Wittgenstein's book, Tractatus Logico-Philosophicus, was a work that advanced, among other things, a logical theory of symbolism and a 'picture' or 'model' theory of language. Schlick and his group were impressed by the work, devoting considerable time to its study and, even when it was no longer the principal focus of their discussion, it was mentioned in discussion. Eventually Wittgenstein agreed to meet with Schlick and other Circle members to discuss the Tractatus and other ideas but he later found it necessary to restrict the visitors to sympathetic interlocutors. Through Schlick's influence, Wittgenstein was encouraged to consider a return to philosophy after some ten years away from the field. Schlick and Waismann's discussions with Wittgenstein continued until the latter felt that germinal ideas had been used without permission in an essay by Carnap, a charge of dubious merit. But he continued discussions in letters to Schlick after he no longer met with other Circle members.", "sameAs": "https://en.wikipedia.org/wiki/Moritz_Schlick", "name": "Moritz Schlick", "image": "https://upload.wikimedia.org/wikipedia/commons/1/17/Schlick_sitting.jpg", "birthPlace": "Berlin, Germany", "@type": ["Person"], "additionalName": "Friedrich Albert Moritz Schlick", "birthDate": "+1882-04-14T00:00:00Z", "honorificPrefix": ""}