{"deathPlace": "Washington, D.C., United States", "jobTitle": "Judge", "knows": "https://en.wikipedia.org/wiki/Chauncey_Wright", "@context": ["http://schema.org"], "givenName": "Oliver", "url": "https://en.wikipedia.org/wiki/Oliver_Wendell_Holmes_Jr.", "familyName": "Holmes", "address": "Boston, MA", "homeLocation": "Boston, MA", "deathDate": "+1935-03-06T00:00:00Z", "description": "Oliver Wendell Holmes Jr. (March 8, 1841 – March 6, 1935) was an American jurist who served as an Associate Justice of the Supreme Court of the United States from 1902 to 1932, and as Acting Chief Justice of the United States January–February 1930. Noted for his long service, his concise and pithy opinions and his deference to the decisions of elected legislatures, he is one of the most widely cited United States Supreme Court justices in history, particularly for his 'clear and present danger' opinion for a unanimous Court in the 1919 case of Schenck v. United States, and is one of the most influential American common law judges, honored during his lifetime in Great Britain as well as the United States. Holmes retired from the Court at the age of 90 years, making him the oldest Justice in the Supreme Court's history. He also served as an Associate Justice and as Chief Justice on the Massachusetts Supreme Judicial Court, and was Weld Professor of Law at the Harvard Law School, of which he was an alumnus. Legal positivism In 1881, in The Common Law, Holmes brought together into a coherent whole his earlier articles and lectures concerning the history of the common law, judicial decisions in England and the United States, which he interpreted from the perspective of a practicing lawyer. What counted as law, to a lawyer, was what judges did in particular cases. Law was what the state would enforce, through violence if necessary; echoes of his experience in the Civil War were always present in his writings. Judges decided where and when the force of the state would be brought to bear, and judges in the modern world tended to consult facts and consequences when deciding what conduct to punish. The decisions of judges, viewed over time, determined the rules of conduct, the legal duties, by which all were bound. Judges did not and should not consult any external system of morality, certainly not a system imposed by the Deity.", "sameAs": "https://www.wikidata.org/wiki/Q360574", "name": "Oliver_Wendell_Holmes_Jr.", "image": "https://upload.wikimedia.org/wikipedia/commons/9/95/Oliver_Wendell_Holmes_Jr_circa_1930-edit.jpg", "birthPlace": "Boston,[Massachusetts, United States", "@type": ["Person"], "additionalName": "Oliver Holmes", "birthDate": "+1841-03-08T00:00:00Z"}